Revit 2027 API
ParameterTypeId.BendingDetailTypeSegmentLengthsDisplayOption Property
 "Straight Segment Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeSegmentLengthsDisplayOption { get; }
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthsDisplayOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthsDisplayOption {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeSegmentLengthsDisplayOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace